/*
Інформаційна шапка.
Команда: Піскурьов Ілля, Нікітенко Катерина, Оболонський Денис,
Полежай Олеся, Заїка Софія.
Група: ІН-01
Назва дисципліни: Об'єктно-орієнтоване програмування мовою Java.
Назва завдання: Java командний проект
Кінцевий термін подання: 01.11.2022
Часу на завдання: 3 тижні
Опис: Напишіть програму для візуалізації відповідної
структури даних. GUI програми мусить містити частину для самої
візуалізації (див. приклад нижче) та частину для контролю візуалізації
у вигляді кнопок. У частині контролю візуалізації повинно бути
щонайменше 5 кнопок, кожна з яких відповідає методу
відповідної структури даних. Структура даних - LinkedHashMap.

Ми підтверджуємо, що це наша власна робота і ми не отримували
жожної не санкціонованної допомоги.
*/

/**
 * Afina - програма, мета якої візуалізувати структуру
 * даних LinkedHashMap. Заснована на технології JavaFX.
 */

/**
 * Main - головний клас програми, який викликає метод запуску
 * з класу Afina. Це потрібно для нормального функціонування
 * jar збірки. Також для збірки потрібен файл MANIFEST.MF, що
 * зберігає дяяку метаінформацію. Зберігається у папці META-INF.
 */
public class Main {
    public static void main(String[] args) {
        Afina.main(args);
    }
}
